// напишите программу, которая принимает на вход трехзначное число и на выходе
// показывает вторую цифру этого числа

int Task = int.Parse(Console.ReadLine());


Console.WriteLine(Task / 10 % 10);

